## CSV IO

In [1]:
from io import StringIO

import numpy as np
import pandas as pd

In [2]:
data = {'Birth': ['9-1-1900', '1-3-1904', '2-28-1889'],
       'Name': [ 'Fred', 'Márge', 'Henry'],
       'Color': ['Red', 'Blue', None],
       'Number': [3, 1, 9]} # option-e a á
df = pd.DataFrame(data)

In [3]:
df

       Birth Color   Name  Number
0   9-1-1900   Red   Fred       3
1   1-3-1904  Blue  Márge       1
2  2-28-1889  None  Henry       9

In [5]:
fout = StringIO()
df.to_csv(fout)
print(fout.getvalue())

,Birth,Color,Name,Number
0,9-1-1900,Red,Fred,3
1,1-3-1904,Blue,Márge,1
2,2-28-1889,,Henry,9

In [6]:
fout = StringIO()
df.to_csv(fout, index=False)
print(fout.getvalue())

Birth,Color,Name,Number
9-1-1900,Red,Fred,3
1-3-1904,Blue,Márge,1
2-28-1889,,Henry,9

In [7]:
fout.seek(0)
df2 = pd.read_csv(fout, encoding='windows-1252')
df2

       Birth Color    Name  Number
0   9-1-1900   Red    Fred       3
1   1-3-1904  Blue  MÃ¡rge       1
2  2-28-1889   NaN   Henry       9

In [9]:
fout.seek(0)
df3 = pd.read_csv(fout, index_col='Number')
df3

            Birth Color   Name
Number
3        9-1-1900   Red   Fred
1        1-3-1904  Blue  Márge
9       2-28-1889   NaN  Henry

In [10]:
fout.seek(0)
df3 = pd.read_csv(fout, index_col=3)
df3

            Birth Color   Name
Number
3        9-1-1900   Red   Fred
1        1-3-1904  Blue  Márge
9       2-28-1889   NaN  Henry

In [12]:
df3.dtypes

Birth    object
Color    object
Name     object
dtype: object

In [13]:
fout.seek(0)
df3 = pd.read_csv(fout, index_col=3, parse_dates=['Birth'])
df3

            Birth Color   Name
Number
3      1900-09-01   Red   Fred
1      1904-01-03  Blue  Márge
9      1889-02-28   NaN  Henry

In [15]:
df3.dtypes

Birth    datetime64[ns]
Color            object
Name             object
dtype: object

### Missing column headers

In [18]:
print(fout.getvalue())

Birth,Color,Name,Number
9-1-1900,Red,Fred,3
1-3-1904,Blue,Márge,1
2-28-1889,,Henry,9

In [19]:
data2 = """9-1-1900,Red,Fred,3
1-3-1904,Blue,Márge,1
2-28-1889,,Henry,9"""
fin = StringIO(data2)

In [20]:
fin.seek(0)
df = pd.read_csv(fin)
df

    9-1-1900   Red   Fred  3
0   1-3-1904  Blue  Márge  1
1  2-28-1889   NaN  Henry  9

In [21]:
fin.seek(0)
df = pd.read_csv(fin, names=['Birth', 'Color', 'Name', 'Number'])
df

       Birth Color   Name  Number
0   9-1-1900   Red   Fred       3
1   1-3-1904  Blue  Márge       1
2  2-28-1889   NaN  Henry       9